app/controllers/constituencies_controller.rb

SELECT "constituencies".* FROM "constituencies"
---
  def index
    @constituencies = Constituency.all

INSERT INTO "constituencies" ("name", "number_of_voters", "voivodeship_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Krakó"], ["number_of_voters", 20], ["voivodeship_id", 2], ["created_at", "2015-01-19 21:29:19.658018"], ["updated_at", "2015-01-19 21:29:19.658018"]]
---
  def create
    @constituency = Constituency.new(constituency_params)

    respond_to do |format|
      if @constituency.save

UPDATE "constituencies" SET "name" = ?, "updated_at" = ? WHERE "constituencies"."id" = ?  [["name", "Kraków"], ["updated_at", "2015-01-19 21:29:27.332277"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @constituency.update(constituency_params)

DELETE FROM "constituencies" WHERE "constituencies"."id" = ?  [["id", 1]]
---
  def destroy
    @constituency.destroy

SELECT  "constituencies".* FROM "constituencies" WHERE "constituencies"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_constituency
      @constituency = Constituency.find(params[:id])

SELECT "voivodeships".* FROM "voivodeships"
---
    def set_voivodeships
      @voivodeships = Voivodeship.all.map do |voivodeship|