app/controllers/voivodeships_controller.rb

  def index
    @voivodeships = Voivodeship.all
---
SELECT "voivodeships".* FROM "voivodeships"

  def create
    @voivodeship = Voivodeship.new(voivodeship_params)

    respond_to do |format|
      if @voivodeship.save
---
INSERT INTO "voivodeships" ("name", "number_of_seats", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Małopolskie"], ["number_of_seats", 150], ["created_at", "2015-01-19 21:28:45.496002"], ["updated_at", "2015-01-19 21:28:45.496002"]]

  def destroy
    @voivodeship.destroy
---
DELETE FROM "voivodeships" WHERE "voivodeships"."id" = ?  [["id", 1]]

    def set_voivodeship
      @voivodeship = Voivodeship.find(params[:id])
---
SELECT  "voivodeships".* FROM "voivodeships" WHERE "voivodeships"."id" = ? LIMIT 1  [["id", 1]]