app/controllers/votes_controller.rb

  def index
    @votes = Vote.all
---
SELECT "votes".* FROM "votes"

  def create
    @vote = Vote.new(vote_params)

    respond_to do |format|
      if @vote.save
---
INSERT INTO "votes" ("number", "number_of_invalid", "constituency_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", 12], ["number_of_invalid", 2], ["constituency_id", 3], ["created_at", "2015-01-20 20:11:41.695756"], ["updated_at", "2015-01-20 20:11:41.695756"]]

    def set_vote
      @vote = Vote.find(params[:id])
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", 1]]

    def set_constituencies
      @constituencies = Constituency.all.map do |constituency|
---
SELECT "constituencies".* FROM "constituencies"